//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯПодготавливаюГруппуСНаименованием(Парам01,Парам02)","ЯПодготавливаюГруппуСНаименованием","Допустим я подготавливаю группу с наименованием ""Материалы""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯПодготавливаюГруппуСНаименованиемСправочника(Парам01,Парам02)","ЯПодготавливаюГруппуСНаименованиемСправочника","Допустим я подготавливаю группу с наименованием ""Материалы"" справочника ""Номенклатура""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСправочникеНоменклатураСНаименованиемНетЭлементов(Парам01)","ВСправочникеНоменклатураСНаименованиемНетЭлементов","Допустим в справочнике номенклатура с наименованием ""Материалы"" нет элементов");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯУказыватьПутьКФайлу()","ЯУказыватьПутьКФайлу","Когда я указывать путь к файлу");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯВыбираюГруппуСНаименованием(Парам01)","ЯВыбираюГруппуСНаименованием","и я выбираю группу с наименованием ""материалы""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯНажимаюКнопкуЗагрузить()","ЯНажимаюКнопкуЗагрузить","и я нажимаю кнопку загрузить");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"МатериалыЗагрузилисьКорректно()","МатериалыЗагрузилисьКорректно","Тогда материалы загрузились корректно");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСправочникеНоменклатураВГруппеСНаименованиемЕстьЭлементы(Парам01)","ВСправочникеНоменклатураВГруппеСНаименованиемЕстьЭлементы","Допустим в справочнике номенклатура в группе с наименованием ""Материалы"" есть элементы");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯОткрываюФайл()","ЯОткрываюФайл","Когда  Я открываю файл");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯВыбираюФайл()","ЯВыбираюФайл","и я выбираю файл");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим в справочнике номенклатура с наименованием "Материалы" нет элементов
//@ВСправочникеНоменклатураСНаименованиемНетЭлементов(Парам01)
Процедура ВСправочникеНоменклатураСНаименованиемНетЭлементов(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Когда  Я открываю файл
//@ЯОткрываюФайл()
Процедура ЯОткрываюФайл() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//и я выбираю файл
//@ЯВыбираюФайл()
Процедура ЯВыбираюФайл() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//и я выбираю группу с наименованием "материалы"
//@ЯВыбираюГруппуСНаименованием(Парам01)
Процедура ЯВыбираюГруппуСНаименованием(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//и я нажимаю кнопку загрузить
//@ЯНажимаюКнопкуЗагрузить()
Процедура ЯНажимаюКнопкуЗагрузить() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда материалы загрузились корректно
//@МатериалыЗагрузилисьКорректно()
Процедура МатериалыЗагрузилисьКорректно() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Допустим в справочнике номенклатура в группе с наименованием "Материалы" есть элементы
//@ВСправочникеНоменклатураВГруппеСНаименованиемЕстьЭлементы(Парам01)
Процедура ВСправочникеНоменклатураВГруппеСНаименованиемЕстьЭлементы(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

//окончание текста модуля

&НаКлиенте
//Допустим я подготавливаю группу с наименованием "Материалы" Справочника "Номенклатуры"
//@ЯПодготавливаюГруппуСНаименованием(Парам01)
Процедура ЯПодготавливаюГруппуСНаименованием(НаименованиеГруппы, ПредставлениеСправочника) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Допустим я подготавливаю группу с наименованием "Материалы" справочника "Номенклатура"
//@ЯПодготавливаюГруппуСНаименованиемСправочника(Парам01,Парам02)
Процедура ЯПодготавливаюГруппуСНаименованиемСправочника(Парам01,Парам02) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Когда я указывать путь к файлу
//@ЯУказыватьПутьКФайлу()
Процедура ЯУказыватьПутьКФайлу() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры
