//начало текста модуля

#Область Служебные_функции_и_процедуры

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ДокументыУдалились()","ДокументыУдалились","Тогда Документы удалились");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ДокументПровелсяКорректно()","ДокументПровелсяКорректно","ТОгда Документ провелся корректно");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции

#КонецОбласти



#Область Работа_со_сценариями

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Тогда Документы удалились
//@ДокументыУдалились()
Процедура ДокументыУдалились() Экспорт
	Если НЕ УдалитьДокиНаСервере("Покупка") Тогда
		Сообщить("НЕ все документы удалены!!");
		//Ванесса.ПосмотретьЗначение(Парам01,Истина);
		ВызватьИсключение "Не реализовано.";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция  УдалитьДокиНаСервере(Парам01)
	ДокВид = Метаданные.Документы[Парам01].Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док.Ссылка
		|ИЗ
		|	Документ."+ДокВид+" КАК Док";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Возврат Ложь;  // не все удалились
	иначе
		Возврат Истина;//все чисто, обработка гуд)
	КонецЕсли;
	
КонецФункции
//окончание текста модуля

&НаКлиенте
//ТОгда Документ провелся корректно
//@ДокументПровелсяКорректно()
Процедура ДокументПровелсяКорректно() Экспорт
	Сообщить("Провелся");
КонецПроцедуры
