# encoding: utf-8
# language: ru

Функционал: Возраст в месяцах	
	Как    Кадровик	
	Хочу   Получить возраст сотрудника в месяцах
	Чтобы  Собрать данные для статистики

Сценарий: 	Вычисление возраста в месяца
	Допустим у меня есть дата рождения сотрудника 12.05.1983
	и у меня есть дата на момент расчета 15.09.2016
	Тогда результат будет равен 0

Сценарий: 	Вычисление возраста в месяца
	Допустим у меня есть дата рождения сотрудника 12.11.1999
	и у меня есть дата на момент расчета 15.09.2016
	Тогда результат будет равен 0
